/*ババ抜き
 * ルール：
 * 参加者は2人
 * 順番にお互いの手札トランプを引いて手札の数字と揃ったら捨てる
 * 先に手札が無くなった方が勝ち
 * */
public class Babanuki {
	public static void main(String[] args) {
		// 必要なモノ用意

		// トランプのインスタンスを生成し、リストに格納(山札にする)

		// 山札をシャッフル

		// プレイヤー二人にトランプを配る

		// 揃った数字をすべて捨てる

		// ゲーム開始！
		do {
			// それぞれの手札をコンソールに表示(CPU側は全部 ? で表示される)

			// 先攻の手番
			// どれを引くか選ぶ（プレイヤー側なので自分で指定する）

			// 選んだトランプを引く

			// 数字が揃っていれば捨てる

			// 手札が無くなればループを抜ける


			// 後攻の手番
			// どれを引くか選ぶ（CPU側なので乱数で指定する）

			// 選んだトランプを引く

			// 数字が揃っていれば捨てる

			// 手札が無くなればループを抜ける

		} while (true);

		// 結果発表

	}
}
